necatidurmus/earendilmotorcontroller/f411-motor-cube/Core/Inc/stm32f4xx_hal_conf.h
/* ============================================================
 * Core/Inc/stm32f4xx_hal_conf.h
 * HAL configuration — CubeMX generated.
 * Modules selected match peripherals enabled in .ioc file.
 * ============================================================ */

#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx.h"

#define HAL_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_USART_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED

/* WeAct BlackPill F411CE uses a 25 MHz crystal */
#define HSE_VALUE            25000000U
#define HSE_STARTUP_TIMEOUT  100U
#define HSI_VALUE            16000000U
#define LSE_VALUE            32768U
#define LSE_STARTUP_TIMEOUT  5000U
#define EXTERNAL_SAI1_CLOCK_VALUE  2097000U
#define VDD_VALUE                    3300U
#define USE_SPI_CRC                  0U

#define  PREFETCH_ENABLE             1U
#define  INSTRUCTION_CACHE_ENABLE    1U
#define  DATA_CACHE_ENABLE           1U
#define  ART_ACCLERATOR_ENABLE       1U

/* System Configuration */
#define  TICK_INT_PRIORITY            0x0FU
#define  USE_RTOS                     0U

#define  USE_HAL_ADC_REGISTER_CALLBACKS    0U
#define  USE_HAL_CAN_REGISTER_CALLBACKS    0U
#define  USE_HAL_CEC_REGISTER_CALLBACKS    0U
#define  USE_HAL_CRYP_REGISTER_CALLBACKS   0U
#define  USE_HAL_DAC_REGISTER_CALLBACKS    0U
#define  USE_HAL_DCMI_REGISTER_CALLBACKS   0U
#define  USE_HAL_DFSDM_REGISTER_CALLBACKS  0U
#define  USE_HAL_DMA2D_REGISTER_CALLBACKS  0U
#define  USE_HAL_DMA_REGISTER_CALLBACKS    0U
#define  USE_HAL_ETH_REGISTER_CALLBACKS    0U
#define  USE_HAL_FMPI2C_REGISTER_CALLBACKS 0U
#define  USE_HAL_FMPSMBUS_REGISTER_CALLBACKS 0U
#define  USE_HAL_HASH_REGISTER_CALLBACKS    0U
#define  USE_HAL_HCD_REGISTER_CALLBACKS     0U
#define  USE_HAL_I2C_REGISTER_CALLBACKS     0U
#define  USE_HAL_I2S_REGISTER_CALLBACKS     0U
#define  USE_HAL_IRDA_REGISTER_CALLBACKS    0U
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS   0U
#define  USE_HAL_LTDC_REGISTER_CALLBACKS    0U
#define  USE_HAL_MMC_REGISTER_CALLBACKS     0U
#define  USE_HAL_NAND_REGISTER_CALLBACKS    0U
#define  USE_HAL_NOR_REGISTER_CALLBACKS     0U
#define  USE_HAL_PCD_REGISTER_CALLBACKS     0U
#define  USE_HAL_PWR_REGISTER_CALLBACKS     0U
#define  USE_HAL_QSPI_REGISTER_CALLBACKS    0U
#define  USE_HAL_RNG_REGISTER_CALLBACKS     0U
#define  USE_HAL_RTC_REGISTER_CALLBACKS     0U
#define  USE_HAL_SAI_REGISTER_CALLBACKS     0U
#define  USE_HAL_SD_REGISTER_CALLBACKS      0U
#define  USE_HAL_SDRAM_REGISTER_CALLBACKS   0U
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS   0U
#define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS 0U
#define  USE_HAL_SRAM_REGISTER_CALLBACKS    0U
#define  USE_HAL_TIM_REGISTER_CALLBACKS     0U
#define  USE_HAL_UART_REGISTER_CALLBACKS    0U
#define  USE_HAL_USART_REGISTER_CALLBACKS   0U
#define  USE_HAL_WWDG_REGISTER_CALLBACKS    0U

/* Assert options */
#define  USE_FULL_ASSERT    0U

/* Ethernet configuration (unused) */
#define  MAC_ADDR0    2U
#define  MAC_ADDR1    0U
#define  MAC_ADDR2    0U
#define  MAC_ADDR3    0U
#define  MAC_ADDR4    0U
#define  MAC_ADDR5    0U
#define  ETH_RX_BUF_SIZE            ETH_MAX_PACKET_SIZE
#define  ETH_TX_BUF_SIZE            ETH_MAX_PACKET_SIZE
#define  ETH_MAX_PACKET_SIZE        1524U
#define  PHY_ENABLED                0U

/* Includes for HAL modules */
#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32f4xx_hal_rcc.h"
#endif
#ifdef HAL_GPIO_MODULE_ENABLED
  #include "stm32f4xx_hal_gpio.h"
#endif
#ifdef HAL_DMA_MODULE_ENABLED
  #include "stm32f4xx_hal_dma.h"
#endif
#ifdef HAL_CORTEX_MODULE_ENABLED
  #include "stm32f4xx_hal_cortex.h"
#endif
#ifdef HAL_ADC_MODULE_ENABLED
  #include "stm32f4xx_hal_adc.h"
#endif
#ifdef HAL_CAN_MODULE_ENABLED
  #include "stm32f4xx_hal_can.h"
#endif
#ifdef HAL_CEC_MODULE_ENABLED
  #include "stm32f4xx_hal_cec.h"
#endif
#ifdef HAL_CRYP_MODULE_ENABLED
  #include "stm32f4xx_hal_cryp.h"
#endif
#ifdef HAL_DAC_MODULE_ENABLED
  #include "stm32f4xx_hal_dac.h"
#endif
#ifdef HAL_DCMI_MODULE_ENABLED
  #include "stm32f4xx_hal_dcmi.h"
#endif
#ifdef HAL_EXTI_MODULE_ENABLED
  #include "stm32f4xx_hal_exti.h"
#endif
#ifdef HAL_FLASH_MODULE_ENABLED
  #include "stm32f4xx_hal_flash.h"
#endif
#ifdef HAL_I2C_MODULE_ENABLED
  #include "stm32f4xx_hal_i2c.h"
#endif
#ifdef HAL_I2S_MODULE_ENABLED
  #include "stm32f4xx_hal_i2s.h"
#endif
#ifdef HAL_IWDG_MODULE_ENABLED
  #include "stm32f4xx_hal_iwdg.h"
#endif
#ifdef HAL_PWR_MODULE_ENABLED
  #include "stm32f4xx_hal_pwr.h"
#endif
#ifdef HAL_RTC_MODULE_ENABLED
  #include "stm32f4xx_hal_rtc.h"
#endif
#ifdef HAL_SDIO_MODULE_ENABLED
  #include "stm32f4xx_hal_sdio.h"
#endif
#ifdef HAL_SPI_MODULE_ENABLED
  #include "stm32f4xx_hal_spi.h"
#endif
#ifdef HAL_TIM_MODULE_ENABLED
  #include "stm32f4xx_hal_tim.h"
#endif
#ifdef HAL_UART_MODULE_ENABLED
  #include "stm32f4xx_hal_uart.h"
#endif
#ifdef HAL_USART_MODULE_ENABLED
  #include "stm32f4xx_hal_usart.h"
#endif
#ifdef HAL_WWDG_MODULE_ENABLED
  #include "stm32f4xx_hal_wwdg.h"
#endif

/* ------------------------- Assert Macro ------------------------- */
#ifdef USE_FULL_ASSERT
  #define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
  void assert_failed(uint8_t *file, uint32_t line);
#else
  #define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4xx_HAL_CONF_H */
